# Дано число обозначающее день недели. 
# Вывести его название и указать является ли он выходным
list=['Monday', 'Tuesday', 'Wensday', 'Thursday', 'Friday','Saturday', 'Sunday']
day = int(intput('enter a number from 1 to 7'))
if list[i]== 5 or 6:
print('Weekend')
else:
    print('Weekday')
